{
  "SYSTEM_MSG_1": {
    "content": "You are an AI assistant that helps people find information. You will receive a task and think step by step. Then provide your final outcome following the regular expression 'Answer: there are [0-9]+ clusters'"
  },
  "SYSTEM_MSG_2": {
    "content": "You are an AI assistant that helps people find information. You will receive a task and think step by step. Then provide your final outcome following the regular expression 'Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+'"
  },
  "valuePath": {
    "content": "You want to organize a fundraiser with 16 socialites. Paul is connected to Bob, Nick, Sherry, and John. Bob is connected to  Paul, Nick, Sherry, and Rose. Nick is connected to  Paul, Bob, Sherry and Amanda. Sherry is also connected to Paul, Bob, Nick, and William. Amanda is connected to  Peter, John, Daisy, and Nick. Peter is connected to Amanda, John, Daisy, and Adam. John is connected to Paul, Daisy, Peter, and Amanda. Daisy is also connected to Amanda, Peter, John, and Maggie. Alisa is connected to Maggie, Jennifer, Adam, and Russell. Maggie is connected to Alisha, Jennifer, Daisy, and Adam. Jennifer is connected to Andrew, Alisha, Adam, and Maggie. Adam is also connected to Alisha, Maggie, Jennifer, and Peter. Andrew is connected to William, Russell, Rose, and Jennifer. William is connected to Sherry, Andrew, Russell, Rose. Russell is connected to Andrew, William, Rose, and Alsiha. Rose is also connected to Andrew, William, Russell, and Bob. Now you are told that Rose can donate $250K while Maggie can donate $500K. Also, if you want to get connected with Amanda, you need to pay $10K to her company. From Paul, what is the path to the person who can donate the most money? Please list the names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "transReval": {
    "content": " You want to organize a fundraiser with 16 socialites. Paul is connected to Bob, Nick, Sherry, and John. Bob is connected to  Paul, Nick, Sherry, and Rose. Nick is connected to  Paul, Bob, Sherry and Amanda. Sherry is also connected to Paul, Bob, Nick, and William. Amanda is connected to  Peter, John, Daisy, and Nick. Peter is connected to Amanda, John, Daisy, and Adam. John is connected to Paul, Daisy, Peter, and Amanda. Daisy is also connected to Amanda, Peter, John, and Maggie. Alisa is connected to Maggie, Jennifer, Adam, and Russell. Maggie is connected to Alisha, Jennifer, Daisy, and Adam. Jennifer is connected to Andrew, Alisha, Adam, and Maggie. Adam is also connected to Alisha, Maggie, Jennifer, and Peter. Andrew is connected to William, Russell, Rose, and Jennifer. William is connected to Sherry, Andrew, Russell, Rose. Russell is connected to Andrew, William, Rose, and Alsiha. Rose is also connected to Andrew, William, Russell, and Bob. Initially, you were told that Rose can donate $250K while Maggie can donate $500K. Also, if you want to get connected with Amanda, you need to pay $10K to her company. Assume now that Bob and Rose are not connected. Also, Peter and Adam are not connected anymore. You have been told that Paul and John are not connected. Also, Andrew and Jennifer are not connected anymore. From Paul, what is the path to the person who can donate the most money? Please list the names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "rewardReval": {
    "content": " You want to organize a fundraiser with 16 socialites. Paul is connected to Bob, Nick, Sherry, and John. Bob is connected to  Paul, Nick, Sherry, and Rose. Nick is connected to  Paul, Bob, Sherry and Amanda. Sherry is also connected to Paul, Bob, Nick, and William. Amanda is connected to  Peter, John, Daisy, and Nick. Peter is connected to Amanda, John, Daisy, and Adam. John is connected to Paul, Daisy, Peter, and Amanda. Daisy is also connected to Amanda, Peter, John, and Maggie. Alisa is connected to Maggie, Jennifer, Adam, and Russell. Maggie is connected to Alisha, Jennifer, Daisy, and Adam. Jennifer is connected to Andrew, Alisha, Adam, and Maggie. Adam is also connected to Alisha, Maggie, Jennifer, and Peter. Andrew is connected to William, Russell, Rose, and Jennifer. William is connected to Sherry, Andrew, Russell, Rose. Russell is connected to Andrew, William, Rose, and Alsiha. Rose is also connected to Andrew, William, Russell, and Bob. Initially, you were told that Rose can donate $250K while Maggie can donate $500K. Also, if you want to get connected with Amanda, you need to pay $10K to her company. Now you have been told that Rose cannot donate anything. From Paul, what is the path to the person who can donate the most money? Please list the names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "policyReval": {
    "content": " You want to organize a fundraiser with 16 socialites. Paul is connected to Bob, Nick, Sherry, and John. Bob is connected to Paul, Nick, Sherry, and Rose. Nick is connected to  Paul, Bob, Sherry and Amanda. Sherry is also connected to Paul, Bob, Nick, and William. Amanda is connected to Peter, John, Daisy, and Nick. Peter is connected to Amanda, John, Daisy, and Adam. John is connected to Paul, Daisy, Peter, and Amanda. Daisy is also connected to Amanda, Peter, John, and Maggie. Alisa is connected to Maggie, Jennifer, Adam, and Russell. Maggie is connected to Alisha, Jennifer, Daisy, and Adam. Jennifer is connected to Andrew, Alisha, Adam, and Maggie. Adam is also connected to Alisha, Maggie, Jennifer, and Peter. Andrew is connected to William, Russell, Rose, and Jennifer. William is connected to Sherry, Andrew, Russell, Rose. Russell is connected to Andrew, William, Rose, and Alsiha. Rose is also connected to Andrew, William, Russell, and Bob. Initially, you were told that Rose can donate $250K while Maggie can donate $500K. Also, if you want to get connected with Amanda, you need to pay $10K to her company. Now you have been told that Rose cannot donate anything. From Paul, what is the path to the person who can donate the most money? Please list the names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "teleShortcut": {
    "content": " You want to organize a fundraiser with 16 socialites. Paul is connected to Bob, Nick, Sherry, and John. Bob is connected to Paul, Nick, Sherry, and Rose. Nick is connected to Paul, Bob, Sherry and Amanda. Sherry is also connected to Paul, Bob, Nick, and William. Amanda is connected to Peter, John, Daisy, and Nick. Peter is connected to Amanda, John, Daisy, and Adam. John is connected to Paul, Daisy, Peter, and Amanda. Daisy is also connected to Amanda, Peter, John, and Maggie. Alisa is connected to Maggie, Jennifer, Adam, and Russell. Maggie is connected to Alisha, Jennifer, Daisy, and Adam. Jennifer is connected to Andrew, Alisha, Adam, and Maggie. Adam is also connected to Alisha, Maggie, Jennifer, and Peter. Andrew is connected to William, Russell, Rose, and Jennifer. William is connected to Sherry, Andrew, Russell, Rose. Russell is connected to Andrew, William, Rose, and Alsiha. Rose is also connected to Andrew, William, Russell, and Bob. Initially, you were told that Rose can donate $250K while Maggie can donate $500K. Also, if you want to get connected with Amanda, you need to pay $10K to her company. You are talking to Paul and he tells you that he can connect you with anyone you want only once. From Paul, what is the path to the person who can donate the most money? Please list the names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "nonteleShortcut": {
    "content": " You want to organize a fundraiser with 16 socialites. Paul is connected to Bob, Nick, Sherry, and John. Bob is connected to Paul, Nick, Sherry, and Rose. Nick is connected to Paul, Bob, Sherry and Amanda. Sherry is also connected to Paul, Bob, Nick, and William. Amanda is connected to Peter, John, Daisy, and Nick. Peter is connected to Amanda, John, Daisy, and Adam. John is connected to Paul, Daisy, Peter, and Amanda. Daisy is also connected to Amanda, Peter, John, and Maggie. Alisa is connected to Maggie, Jennifer, Adam, and Russell. Maggie is connected to Alisha, Jennifer, Daisy, and Adam. Jennifer is connected to Andrew, Alisha, Adam, and Maggie. Adam is also connected to Alisha, Maggie, Jennifer, and Peter. Andrew is connected to William, Russell, Rose, and Jennifer. William is connected to Sherry, Andrew, Russell, Rose. Russell is connected to Andrew, William, Rose, and Alsiha. Rose is also connected to Andrew, William, Russell, and Bob. Initially, you were told that Rose can donate $250K while Maggie can donate $500K. Also, if you want to get connected with Amanda, you need to pay $10K to her company. You have been told that Rose is now connected to Alisha. From Paul, what is the path to the person who can donate the most money? Please list the names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "teleDetour": {
    "content": " You want to organize a fundraiser with 16 socialites. Paul is connected to Bob, Nick, Sherry, and John. Bob is connected to Paul, Nick, Sherry, and Rose. Nick is connected to Paul, Bob, Sherry and Amanda. Sherry is also connected to Paul, Bob, Nick, and William. Amanda is connected to Peter, John, Daisy, and Nick. Peter is connected to Amanda, John, Daisy, and Adam. John is connected to Paul, Daisy, Peter, and Amanda. Daisy is also connected to Amanda, Peter, John, and Maggie. Alisa is connected to Maggie, Jennifer, Adam, and Russell. Maggie is connected to Alisha, Jennifer, Daisy, and Adam. Jennifer is connected to Andrew, Alisha, Adam, and Maggie. Adam is also connected to Alisha, Maggie, Jennifer, and Peter. Andrew is connected to William, Russell, Rose, and Jennifer. William is connected to Sherry, Andrew, Russell, Rose. Russell is connected to Andrew, William, Rose, and Alsiha. Rose is also connected to Andrew, William, Russell, and Bob. Initially, you were told that Rose can donate $250K while Maggie can donate $500K. Also, if you want to get connected with Amanda, you need to pay $10K to her company. You are talking to Paul and he tells you that he can connect you with anyone you want only once. At the same time, you have been told that there is no connection between Andrew and Jennifer and also there is no connection between Russell and Alisha. From Paul, what is the path to the person who can donate the most money? Please list the names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "nonteleDetour": {
    "content": " You want to organize a fundraiser with 16 socialites. Paul is connected to Bob, Nick, Sherry, and John. Bob is connected to Paul, Nick, Sherry, and Rose. Nick is connected to Paul, Bob, Sherry and Amanda. Sherry is also connected to Paul, Bob, Nick, and William. Amanda is connected to Peter, John, Daisy, and Nick. Peter is connected to Amanda, John, Daisy, and Adam. John is connected to Paul, Daisy, Peter, and Amanda. Daisy is also connected to Amanda, Peter, John, and Maggie. Alisa is connected to Maggie, Jennifer, Adam, and Russell. Maggie is connected to Alisha, Jennifer, Daisy, and Adam. Jennifer is connected to Andrew, Alisha, Adam, and Maggie. Adam is also connected to Alisha, Maggie, Jennifer, and Peter. Andrew is connected to William, Russell, Rose, and Jennifer. William is connected to Sherry, Andrew, Russell, Rose. Russell is connected to Andrew, William, Rose, and Alsiha. Rose is also connected to Andrew, William, Russell, and Bob. Initially, you were told that Rose can donate $250K while Maggie can donate $500K. Also, if you want to get connected with Amanda, you need to pay $10K to her company. While connecting with Paul, you come to know that Jennifer and Andrew are not talking anymore and also Alisha and Russell are fighting so the connection between them is gone. From Paul, what is the path to the person who can donate the most money? Please list the names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "nClusters": {
    "content": " You want to organize a fundraiser with 16 socialites. Paul is connected to Bob, Nick, Sherry, and John. Bob is connected to Paul, Nick, Sherry, and Rose. Nick is connected to Paul, Bob, Sherry and Amanda. Sherry is also connected to Paul, Bob, Nick, and William. Amanda is connected to Peter, John, Daisy, and Nick. Peter is connected to Amanda, John, Daisy, and Adam. John is connected to Paul, Daisy, Peter, and Amanda. Daisy is also connected to Amanda, Peter, John, and Maggie. Alisa is connected to Maggie, Jennifer, Adam, and Russell. Maggie is connected to Alisha, Jennifer, Daisy, and Adam. Jennifer is connected to Andrew, Alisha, Adam, and Maggie. Adam is also connected to Alisha, Maggie, Jennifer, and Peter. Andrew is connected to William, Russell, Rose, and Jennifer. William is connected to Sherry, Andrew, Russell, Rose. Russell is connected to Andrew, William, Rose, and Alsiha. Rose is also connected to Andrew, William, Russell, and Bob. How many densely-connected clusters of persons are there in this fundraiser? A densely-connected cluster is a group of persons that are connected to themselves with a max of 2 persons.",
    "response_pattern": "Answer: [Tt]here are [0-9]+ clusters"
  },
  "1stepPath": {
    "content": "You want to organize a fundraiser with 16 socialites. Paul is connected to Bob, Nick, Sherry, and John. Bob is connected to Paul, Nick, Sherry, and Rose. Nick is connected to Paul, Bob, Sherry and Amanda. Sherry is also connected to Paul, Bob, Nick, and William. Amanda is connected to Peter, John, Daisy, and Nick. Peter is connected to Amanda, John, Daisy, and Adam. John is connected to Paul, Daisy, Peter, and Amanda. Daisy is also connected to Amanda, Peter, John, and Maggie. Alisa is connected to Maggie, Jennifer, Adam, and Russell. Maggie is connected to Alisha, Jennifer, Daisy, and Adam. Jennifer is connected to Andrew, Alisha, Adam, and Maggie. Adam is also connected to Alisha, Maggie, Jennifer, and Peter. Andrew is connected to William, Russell, Rose, and Jennifer. William is connected to Sherry, Andrew, Russell, Rose. Russell is connected to Andrew, William, Rose, and Alsiha. Rose is also connected to Andrew, William, Russell, and Bob.  What is the shortest path from Daisy to Peter? Please list the names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "2stepPath": {
    "content": " You want to organize a fundraiser with 16 socialites. Paul is connected to Bob, Nick, Sherry, and John. Bob is connected to Paul, Nick, Sherry, and Rose. Nick is connected to Paul, Bob, Sherry and Amanda. Sherry is also connected to Paul, Bob, Nick, and William. Amanda is connected to Peter, John, Daisy, and Nick. Peter is connected to Amanda, John, Daisy, and Adam. John is connected to Paul, Daisy, Peter, and Amanda. Daisy is also connected to Amanda, Peter, John, and Maggie. Alisa is connected to Maggie, Jennifer, Adam, and Russell. Maggie is connected to Alisha, Jennifer, Daisy, and Adam. Jennifer is connected to Andrew, Alisha, Adam, and Maggie. Adam is also connected to Alisha, Maggie, Jennifer, and Peter. Andrew is connected to William, Russell, Rose, and Jennifer. William is connected to Sherry, Andrew, Russell, Rose. Russell is connected to Andrew, William, Rose, and Alsiha. Rose is also connected to Andrew, William, Russell, and Bob. What is the shortest path from William to Alisha? Please list the names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "3stepPath": {
    "content": " You want to organize a fundraiser with 16 socialites. Paul is connected to Bob, Nick, Sherry, and John. Bob is connected to Paul, Nick, Sherry, and Rose. Nick is connected to Paul, Bob, Sherry and Amanda. Sherry is also connected to Paul, Bob, Nick, and William. Amanda is connected to Peter, John, Daisy, and Nick. Peter is connected to Amanda, John, Daisy, and Adam. John is connected to Paul, Daisy, Peter, and Amanda. Daisy is also connected to Amanda, Peter, John, and Maggie. Alisa is connected to Maggie, Jennifer, Adam, and Russell. Maggie is connected to Alisha, Jennifer, Daisy, and Adam. Jennifer is connected to Andrew, Alisha, Adam, and Maggie. Adam is also connected to Alisha, Maggie, Jennifer, and Peter. Andrew is connected to William, Russell, Rose, and Jennifer. William is connected to Sherry, Andrew, Russell, Rose. Russell is connected to Andrew, William, Rose, and Alsiha. Rose is also connected to Andrew, William, Russell, and Bob. What is the shortest path from Nick to Russell? Please list the names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "nstepPath": {
    "content": " You want to organize a fundraiser with 16 socialites. Paul is connected to Bob, Nick, Sherry, and John. Bob is connected to Paul, Nick, Sherry, and Rose. Nick is connected to Paul, Bob, Sherry and Amanda. Sherry is also connected to Paul, Bob, Nick, and William. Amanda is connected to Peter, John, Daisy, and Nick. Peter is connected to Amanda, John, Daisy, and Adam. John is connected to Paul, Daisy, Peter, and Amanda. Daisy is also connected to Amanda, Peter, John, and Maggie. Alisa is connected to Maggie, Jennifer, Adam, and Russell. Maggie is connected to Alisha, Jennifer, Daisy, and Adam. Jennifer is connected to Andrew, Alisha, Adam, and Maggie. Adam is also connected to Alisha, Maggie, Jennifer, and Peter. Andrew is connected to William, Russell, Rose, and Jennifer. William is connected to Sherry, Andrew, Russell, Rose. Russell is connected to Andrew, William, Rose, and Alsiha. Rose is also connected to Andrew, William, Russell, and Bob. What is the shortest path from Russell to John? Please list the names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "CONVERSATIONS": [
    {
      "valuePath": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "valuePath",
          "expected_answer": [
            "Answer: Paul, Bob, Rose, Russell, Alisha, Maggie",
            "Answer: Paul, Bob, Rose, Andrew, Jennifer, Maggie"
          ]
        }
      ]
    },
    {
      "transReval": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "transReval",
          "expected_answer": [
            "Answer: Paul, Sherry, William, Rose, Russell, Alisha, Maggie"
          ]
        }
      ]
    },
    {
      "rewardReval": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "rewardReval",
          "expected_answer": [
            "Answer: Paul, John, Daisy, Maggie"
          ]
        }
      ]
    },
    {
      "policyReval": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "policyReval",
          "expected_answer": [
            "Answer: Paul, John, Daisy, Maggie "
          ]
        }
      ]
    },
    {
      "teleShortcut": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "teleShortcut",
          "expected_answer": [
            "Answer: Maggie, Alisha, Russell, Rose",
            "Answer: Rose, Russell, Alsiha, Maggie",
            "Answer: Maggie, Jennifer, Andrew, Rose",
            "Answer: Rose, Andrew, Jennifer, Maggie"
          ]
        }
      ]
    },
    {
      "nonteleShortcut": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "nonteleShortcut",
          "expected_answer": [
            "Answer: Paul, Bob, Rose, Alisha, Maggie"
          ]
        }
      ]
    },
    {
      "teleDetour": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "teleDetour",
          "expected_answer": [
            "Answer: Rose, Bob, Paul, John, Peter, Adam, Maggie"
          ]
        }
      ]
    },
    {
      "nonteleDetour": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "nonteleDetour",
          "expected_answer": [
            "Answer: Paul, Bob, Rose, Bob, Paul, John, Peter, Adam, Maggie"
          ]
        }
      ]
    },
    {
      "nClusters": [
        {
          "prompt_id": "SYSTEM_MSG_1"
        },
        {
          "prompt_id": "nClusters",
          "expected_answer": [
            "Answer: there are 4 clusters"
          ]
        }
      ]
    },
    {
      "1stepPath": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "1stepPath",
          "expected_answer": [
            "Answer: Daisy, Peter"
          ]
        }
      ]
    },
    {
      "2stepPath": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "2stepPath",
          "expected_answer": [
            "Answer: William, Russell, Alisha"
          ]
        }
      ]
    },
    {
      "3stepPath": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "3stepPath",
          "expected_answer": [
            "Answer: Nick, Bob, Rose, Russell",
            "Answer: Nick, Sherry, William, Russell"
          ]
        }
      ]
    },
    {
      "nstepPath": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "nstepPath",
          "expected_answer": [
            "Answer: Russell, Alisha, Adam, Peter, John",
            "Answer: Russell, William, Sherry, Paul, John"
          ]
        }
      ]
    }
  ]
}