{
  "SYSTEM_MSG_1": {
    "content": "You are an AI assistant that helps people find information. You will receive a task and think step by step. Then provide your final outcome following the regular expression 'Answer: there are [0-9]+ clusters'"
  },
  "SYSTEM_MSG_2": {
    "content": "You are an AI assistant that helps people find information. You will receive a task and think step by step. Then provide your final outcome following the regular expression 'Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+'"
  },
  "valuePath": {
    "content": "Imagine a university campus with 16 buildings. Electrical engineering building is connected to law school building, computer science building, heath center, and art library. Law school building is connected to electrical engineering building, computer science building, health center, and gym. Computer science building is connected to rooms electrical engineering building, law school building , health center and Starbucks. Health center is also connected to electrical engineering building, computer science building, law school buildings, and Yogurtland. Starbucks is connected to bioscience building, art library, student union building, and computer science building. Bioscience building is connected to Starbucks, art library, student union building, and KFC. Art library is connected to electrical engineering building, student union building, bioscience building, and Starbucks. Student union building is also connected to Starbucks, bioscience building, art library, and football stadium. Musical theater is connected to football stadium, swimming center, KFC, and science library. Football stadium is connected to musical theater, swimming center, student union building, and KFC. Swimming center is connected to Panda Express, musical theater, KFC, and football stadium. KFC is also connected to musical theater, football stadium, swimming center, and bioscience building. Panda Express is connected to Yogurtland, science library, gym, and swimming center. Yogurtland is connected to health center, Panda Express, science library and gym. Science library is connected to Panda Express, Yogurtland, gym, and musical theater. Gym is also connected to Panda Express, Yogurtland, science library, and law school building. Now you have been told that there is a reward of 5 for visiting gym, and a reward of 10 for visiting football stadium. Also, there is a penalty of 15 for visiting Starbucks. From electrical engineering building what is the path that yields the most reward? Please list the buildings in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "transReval": {
    "content": "Imagine a university campus with 16 buildings. Electrical engineering building is connected to law school building, computer science building, heath center, and art library. Law school building is connected to electrical engineering building, computer science building, health center, and gym. Computer science building is connected to rooms electrical engineering building, law school building , health center and Starbucks. Health center is also connected to electrical engineering building, computer science building, law school buildings, and Yogurtland. Starbucks is connected to bioscience building, art library, student union building, and computer science building. Bioscience building is connected to Starbucks, art library, student union building, and KFC. Art library is connected to electrical engineering building, student union building, bioscience building, and Starbucks. Student union building is also connected to Starbucks, bioscience building, art library, and football stadium. Musical theater is connected to football stadium, swimming center, KFC, and science library. Football stadium is connected to musical theater, swimming center, student union building, and KFC. Swimming center is connected to Panda Express, musical theater, KFC, and football stadium. KFC is also connected to musical theater, football stadium, swimming center, and bioscience building. Panda Express is connected to Yogurtland, science library, gym, and swimming center. Yogurtland is connected to health center, Panda Express, science library and gym. Science library is connected to Panda Express, Yogurtland, gym, and musical theater. Gym is also connected to Panda Express, Yogurtland, science library, and law school building. Initially, you were told that there is a reward of 5 for visiting gym, and a reward of 10 for visiting football stadium. Also, there is a penalty of 15 for visiting Starbucks. Assume now that law school building and gym are not connected. Also, KFC and bioscience building are not connected anymore. You have been told that electrical engineering building and art library are not connected. Also, Panda Express and swimming center are not connected anymore. From electrical engineering building what is the path to the building that yields the most reward? Please list the buildings in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "rewardReval": {
    "content": "Imagine a university campus with 16 buildings. Electrical engineering building is connected to law school building, computer science building, heath center, and art library. Law school building is connected to electrical engineering building, computer science building, health center, and gym. Computer science building is connected to rooms electrical engineering building, law school building , health center and Starbucks. Health center is also connected to electrical engineering building, computer science building, law school buildings, and Yogurtland. Starbucks is connected to bioscience building, art library, student union building, and computer science building. Bioscience building is connected to Starbucks, art library, student union building, and KFC. Art library is connected to electrical engineering building, student union building, bioscience building, and Starbucks. Student union building is also connected to Starbucks, bioscience building, art library, and football stadium. Musical theater is connected to football stadium, swimming center, KFC, and science library. Football stadium is connected to musical theater, swimming center, student union building, and KFC. Swimming center is connected to Panda Express, musical theater, KFC, and football stadium. KFC is also connected to musical theater, football stadium, swimming center, and bioscience building. Panda Express is connected to Yogurtland, science library, gym, and swimming center. Yogurtland is connected to health center, Panda Express, science library and gym. Science library is connected to Panda Express, Yogurtland, gym, and musical theater. Gym is also connected to Panda Express, Yogurtland, science library, and law school building. Initially, you were told that there is a reward of 5 for visiting gym, and a reward of 10 for visiting football stadium. Also, there is a penalty of 15 for visiting Starbucks. Now you have been told that there is no reward for visiting the gym. From electrical engineering building what is the path to the building that yields the most reward? Please list the buildings in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "policyReval": {
    "content": "Imagine a university campus with 16 buildings. Electrical engineering building is connected to law school building, computer science building, heath center, and art library. Law school building is connected to electrical engineering building, computer science building, health center, and gym. Computer science building is connected to rooms electrical engineering building, law school building , health center and Starbucks. Health center is also connected to electrical engineering building, computer science building, law school buildings, and Yogurtland. Starbucks is connected to bioscience building, art library, student union building, and computer science building. Bioscience building is connected to Starbucks, art library, student union building, and KFC. Art library is connected to electrical engineering building, student union building, bioscience building, and Starbucks. Student union building is also connected to Starbucks, bioscience building, art library, and football stadium. Musical theater is connected to football stadium, swimming center, KFC, and science library. Football stadium is connected to musical theater, swimming center, student union building, and KFC. Swimming center is connected to Panda Express, musical theater, KFC, and football stadium. KFC is also connected to musical theater, football stadium, swimming center, and bioscience building. Panda Express is connected to Yogurtland, science library, gym, and swimming center. Yogurtland is connected to health center, Panda Express, science library and gym. Science library is connected to Panda Express, Yogurtland, gym, and musical theater. Gym is also connected to Panda Express, Yogurtland, science library, and law school building. Initially, you have been told that there is a reward of 5 for visiting gym, and a reward of 10 for visiting football stadium. Also, there is a penalty of 15 for visiting Starbucks. Now you have been told that there is a reward of 0 for visiting gym. From electrical engineering building what is the path to the building that yields the most reward? Please list the buildings in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "teleShortcut": {
    "content": " Imagine a university campus with 16 buildings. Electrical engineering building is connected to law school building, computer science building, heath center, and art library. Law school building is connected to electrical engineering building, computer science building, health center, and gym. Computer science building is connected to rooms electrical engineering building, law school building , health center and Starbucks. Health center is also connected to electrical engineering building, computer science building, law school buildings, and Yogurtland. Starbucks is connected to bioscience building, art library, student union building, and computer science building. Bioscience building is connected to Starbucks, art library, student union building, and KFC. Art library is connected to electrical engineering building, student union building, bioscience building, and Starbucks. Student union building is also connected to Starbucks, bioscience building, art library, and football stadium. Musical theater is connected to football stadium, swimming center, KFC, and science library. Football stadium is connected to musical theater, swimming center, student union building, and KFC. Swimming center is connected to Panda Express, musical theater, KFC, and football stadium. KFC is also connected to musical theater, football stadium, swimming center, and bioscience building. Panda Express is connected to Yogurtland, science library, gym, and swimming center. Yogurtland is connected to health center, Panda Express, science library and gym. Science library is connected to Panda Express, Yogurtland, gym, and musical theater. Gym is also connected to Panda Express, Yogurtland, science library, and law school building. Initially, you were told that there is a reward of 5 for visiting gym, and a reward of 10 for visiting football stadium. Also, there is a penalty of 15 for visiting Starbucks. You are in electrical engineering building and a portal appears with which you can teleport to any building only once. From electrical engineering building what is the path to the building that yields the most reward? Please list the buildings in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "nonteleShortcut": {
    "content": "Imagine a university campus with 16 buildings. Electrical engineering building is connected to law school building, computer science building, heath center, and art library. Law school building is connected to electrical engineering building, computer science building, health center, and gym. Computer science building is connected to rooms electrical engineering building, law school building , health center and Starbucks. Health center is also connected to electrical engineering building, computer science building, law school buildings, and Yogurtland. Starbucks is connected to bioscience building, art library, student union building, and computer science building. Bioscience building is connected to Starbucks, art library, student union building, and KFC. Art library is connected to electrical engineering building, student union building, bioscience building, and Starbucks. Student union building is also connected to Starbucks, bioscience building, art library, and football stadium. Musical theater is connected to football stadium, swimming center, KFC, and science library. Football stadium is connected to musical theater, swimming center, student union building, and KFC. Swimming center is connected to Panda Express, musical theater, KFC, and football stadium. KFC is also connected to musical theater, football stadium, swimming center, and bioscience building. Panda Express is connected to Yogurtland, science library, gym, and swimming center. Yogurtland is connected to health center, Panda Express, science library and gym. Science library is connected to Panda Express, Yogurtland, gym, and musical theater. Gym is also connected to Panda Express, Yogurtland, science library, and law school building. Initially, you were told that there is a reward of 5 for visiting gym, and a reward of 10 for visiting football stadium. Also, there is a penalty of 15 for visiting Starbucks. You have been told that the gym is now connected to the musical theater. From electrical engineering building what is the path to the building that yields the most reward? Please list the buildings in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "teleDetour": {
    "content": " Imagine a university campus with 16 buildings. Electrical engineering building is connected to law school building, computer science building, heath center, and art library. Law school building is connected to electrical engineering building, computer science building, health center, and gym. Computer science building is connected to rooms electrical engineering building, law school building , health center and Starbucks. Health center is also connected to electrical engineering building, computer science building, law school buildings, and Yogurtland. Starbucks is connected to bioscience building, art library, student union building, and computer science building. Bioscience building is connected to Starbucks, art library, student union building, and KFC. Art library is connected to electrical engineering building, student union building, bioscience building, and Starbucks. Student union building is also connected to Starbucks, bioscience building, art library, and football stadium. Musical theater is connected to football stadium, swimming center, KFC, and science library. Football stadium is connected to musical theater, swimming center, student union building, and KFC. Swimming center is connected to Panda Express, musical theater, KFC, and football stadium. KFC is also connected to musical theater, football stadium, swimming center, and bioscience building. Panda Express is connected to Yogurtland, science library, gym, and swimming center. Yogurtland is connected to health center, Panda Express, science library and gym. Science library is connected to Panda Express, Yogurtland, gym, and musical theater. Gym is also connected to Panda Express, Yogurtland, science library, and law school building. Initially, you were told that there is a reward of 5 for visiting gym, and a reward of 10 for visiting football stadium. Also, there is a penalty of 15 for visiting Starbucks. You are in electrical engineering building and a portal appears with which you can teleport to any building only once. At the same time, you have been told that there is no path between Panda Express and KFC and also there is no path between science library and musical theater. From electrical engineering building what is the path to the building that yields the most reward? Please list the buildings in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "nonteleDetour": {
    "content": " Imagine a university campus with 16 buildings. Electrical engineering building is connected to law school building, computer science building, heath center, and art library. Law school building is connected to electrical engineering building, computer science building, health center, and gym. Computer science building is connected to rooms electrical engineering building, law school building , health center and Starbucks. Health center is also connected to electrical engineering building, computer science building, law school buildings, and Yogurtland. Starbucks is connected to bioscience building, art library, student union building, and computer science building. Bioscience building is connected to Starbucks, art library, student union building, and KFC. Art library is connected to electrical engineering building, student union building, bioscience building, and Starbucks. Student union building is also connected to Starbucks, bioscience building, art library, and football stadium. Musical theater is connected to football stadium, swimming center, KFC, and science library. Football stadium is connected to musical theater, swimming center, student union building, and KFC. Swimming center is connected to Panda Express, musical theater, KFC, and football stadium. KFC is also connected to musical theater, football stadium, swimming center, and bioscience building. Panda Express is connected to Yogurtland, science library, gym, and swimming center. Yogurtland is connected to health center, Panda Express, science library and gym. Science library is connected to Panda Express, Yogurtland, gym, and musical theater. Gym is also connected to Panda Express, Yogurtland, science library, and law school building. Initially, you were told that there is a reward of 5 for visiting gym, and a reward of 10 for visiting football stadium. Also, there is a penalty of 15 for visiting Starbucks. You are in the electrical engineering building and you have been told that there is no path between Panda Express and KFC and also there is no path between science library and musical theater. From electrical engineering building what is the path to the building that yields the most reward? Please list the buildings in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "nClusters": {
    "content": " Imagine a university campus with 16 buildings. Electrical engineering building is connected to law school building, computer science building, heath center, and art library. Law school building is connected to electrical engineering building, computer science building, health center, and gym. Computer science building is connected to rooms electrical engineering building, law school building , health center and Starbucks. Health center is also connected to electrical engineering building, computer science building, law school buildings, and Yogurtland. Starbucks is connected to bioscience building, art library, student union building, and computer science building. Bioscience building is connected to Starbucks, art library, student union building, and KFC. Art library is connected to electrical engineering building, student union building, bioscience building, and Starbucks. Student union building is also connected to Starbucks, bioscience building, art library, and football stadium. Musical theater is connected to football stadium, swimming center, KFC, and science library. Football stadium is connected to musical theater, swimming center, student union building, and KFC. Swimming center is connected to Panda Express, musical theater, KFC, and football stadium. KFC is also connected to musical theater, football stadium, swimming center, and bioscience building. Panda Express is connected to Yogurtland, science library, gym, and swimming center. Yogurtland is connected to health center, Panda Express, science library and gym. Science library is connected to Panda Express, Yogurtland, gym, and musical theater. Gym is also connected to Panda Express, Yogurtland, science library, and law school building. How many densely-connected clusters of buildings are there in this university? A densely-connected cluster is a group of buildings that are connected to themselves with a max of 2 buildings.",
    "response_pattern": "Answer: [Tt]here are [0-9]+ clusters"
  },
  "1stepPath": {
    "content": " Imagine a university campus with 16 buildings. Electrical engineering building is connected to law school building, computer science building, heath center, and art library. Law school building is connected to electrical engineering building, computer science building, health center, and gym. Computer science building is connected to rooms electrical engineering building, law school building , health center and Starbucks. Health center is also connected to electrical engineering building, computer science building, law school buildings, and Yogurtland. Starbucks is connected to bioscience building, art library, student union building, and computer science building. Bioscience building is connected to Starbucks, art library, student union building, and KFC. Art library is connected to electrical engineering building, student union building, bioscience building, and Starbucks. Student union building is also connected to Starbucks, bioscience building, art library, and football stadium. Musical theater is connected to football stadium, swimming center, KFC, and science library. Football stadium is connected to musical theater, swimming center, student union building, and KFC. Swimming center is connected to Panda Express, musical theater, KFC, and football stadium. KFC is also connected to musical theater, football stadium, swimming center, and bioscience building. Panda Express is connected to Yogurtland, science library, gym, and swimming center. Yogurtland is connected to health center, Panda Express, science library and gym. Science library is connected to Panda Express, Yogurtland, gym, and musical theater. Gym is also connected to Panda Express, Yogurtland, science library, and law school building. What is the shortest path from student union building to bioscience building? Please list the buildings in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "2stepPath": {
    "content": " Imagine a university campus with 16 buildings. Electrical engineering building is connected to law school building, computer science building, heath center, and art library. Law school building is connected to electrical engineering building, computer science building, health center, and gym. Computer science building is connected to rooms electrical engineering building, law school building , health center and Starbucks. Health center is also connected to electrical engineering building, computer science building, law school buildings, and Yogurtland. Starbucks is connected to bioscience building, art library, student union building, and computer science building. Bioscience building is connected to Starbucks, art library, student union building, and KFC. Art library is connected to electrical engineering building, student union building, bioscience building, and Starbucks. Student union building is also connected to Starbucks, bioscience building, art library, and football stadium. Musical theater is connected to football stadium, swimming center, KFC, and science library. Football stadium is connected to musical theater, swimming center, student union building, and KFC. Swimming center is connected to Panda Express, musical theater, KFC, and football stadium. KFC is also connected to musical theater, football stadium, swimming center, and bioscience building. Panda Express is connected to Yogurtland, science library, gym, and swimming center. Yogurtland is connected to health center, Panda Express, science library and gym. Science library is connected to Panda Express, Yogurtland, gym, and musical theater. Gym is also connected to Panda Express, Yogurtland, science library, and law school building. What is the shortest path from Yogurtland to the musical theater? Please list the buildings in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "3stepPath": {
    "content": " Imagine a university campus with 16 buildings. Electrical engineering building is connected to law school building, computer science building, heath center, and art library. Law school building is connected to electrical engineering building, computer science building, health center, and gym. Computer science building is connected to rooms electrical engineering building, law school building , health center and Starbucks. Health center is also connected to electrical engineering building, computer science building, law school buildings, and Yogurtland. Starbucks is connected to bioscience building, art library, student union building, and computer science building. Bioscience building is connected to Starbucks, art library, student union building, and KFC. Art library is connected to electrical engineering building, student union building, bioscience building, and Starbucks. Student union building is also connected to Starbucks, bioscience building, art library, and football stadium. Musical theater is connected to football stadium, swimming center, KFC, and science library. Football stadium is connected to musical theater, swimming center, student union building, and KFC. Swimming center is connected to Panda Express, musical theater, KFC, and football stadium. KFC is also connected to musical theater, football stadium, swimming center, and bioscience building. Panda Express is connected to Yogurtland, science library, gym, and swimming center. Yogurtland is connected to health center, Panda Express, science library and gym. Science library is connected to Panda Express, Yogurtland, gym, and musical theater. Gym is also connected to Panda Express, Yogurtland, science library, and law school building. What is the shortest path from computer science building to the science library? Please list the buildings in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "nstepPath": {
    "content": " Imagine a university campus with 16 buildings. Electrical engineering building is connected to law school building, computer science building, heath center, and art library. Law school building is connected to electrical engineering building, computer science building, health center, and gym. Computer science building is connected to rooms electrical engineering building, law school building , health center and Starbucks. Health center is also connected to electrical engineering building, computer science building, law school buildings, and Yogurtland. Starbucks is connected to bioscience building, art library, student union building, and computer science building. Bioscience building is connected to Starbucks, art library, student union building, and KFC. Art library is connected to electrical engineering building, student union building, bioscience building, and Starbucks. Student union building is also connected to Starbucks, bioscience building, art library, and football stadium. Musical theater is connected to football stadium, swimming center, KFC, and science library. Football stadium is connected to musical theater, swimming center, student union building, and KFC. Swimming center is connected to Panda Express, musical theater, KFC, and football stadium. KFC is also connected to musical theater, football stadium, swimming center, and bioscience building. Panda Express is connected to Yogurtland, science library, gym, and swimming center. Yogurtland is connected to health center, Panda Express, science library and gym. Science library is connected to Panda Express, Yogurtland, gym, and musical theater. Gym is also connected to Panda Express, Yogurtland, science library, and law school building. What is the shortest path from the science library to the art library? Please list the buildings in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "CONVERSATIONS": [
    {
      "valuePath": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "valuePath",
          "expected_answer": [
            "Answer: Electrical engineering building, law school building, gym, science library, musical theater, football stadium",
            "Answer: : Electrical engineering building, law school building, gym, Panda Express, swimming center, football stadium"
          ]
        }
      ]
    },
    {
      "transReval": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "transReval",
          "expected_answer": [
            "Answer: Electrical engineering building, health center, Yogurtland, gym, science library, musical theater, football stadium"
          ]
        }
      ]
    },
    {
      "rewardReval": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "rewardReval",
          "expected_answer": [
            "Answer: Electrical engineering building, art library, student union library, football stadium"
          ]
        }
      ]
    },
    {
      "policyReval": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "policyReval",
          "expected_answer": [
            "Answer: Electrical engineering building, art library, student union library, football stadium"
          ]
        }
      ]
    },
    {
      "teleShortcut": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "teleShortcut",
          "expected_answer": [
            "Answer: Football stadium, musical theater, science library, gym",
            "Answer: Gym, science library, musical theater, football stadium",
            "Answer: Football stadium, swimming center, Panda Express, gym",
            "Answer: Gym, Panda Express, Swimming center, football stadium"
          ]
        }
      ]
    },
    {
      "nonteleShortcut": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "nonteleShortcut",
          "expected_answer": [
            "Answer: Electrical engineering building, law school building, gym, musical theater, football stadium"
          ]
        }
      ]
    },
    {
      "teleDetour": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "teleDetour",
          "expected_answer": [
            "Answer: Gym, law school building, electrical engineering building, art library, bioscience building, KFC, football stadium"
          ]
        }
      ]
    },
    {
      "nonteleDetour": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "nonteleDetour",
          "expected_answer": [
            "Answer: Electrical engineering building, law school building, gym, law school building, electrical engineering building, art library, bioscience library, KFC, football stadium"
          ]
        }
      ]
    },
    {
      "nClusters": [
        {
          "prompt_id": "SYSTEM_MSG_1"
        },
        {
          "prompt_id": "nClusters",
          "expected_answer": [
            "Answer: there are 4 clusters"
          ]
        }
      ]
    },
    {
      "1stepPath": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "1stepPath",
          "expected_answer": [
            "Answer: Student union building, bioscience building"
          ]
        }
      ]
    },
    {
      "2stepPath": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "2stepPath",
          "expected_answer": [
            "Answer: Yogurtland, science library, musical theater"
          ]
        }
      ]
    },
    {
      "3stepPath": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "3stepPath",
          "expected_answer": [
            "Answer: Computer science building, law school building, gym, science building",
            "Answer: Computer science building, health center, Yogurtland, science library"
          ]
        }
      ]
    },
    {
      "nstepPath": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "nstepPath",
          "expected_answer": [
            "Answer: Science library, musical theater, KFC, bioscience building, art library",
            "Answer: Science library, Yogurtland, health center, electrical engineering building, art library"
          ]
        }
      ]
    }
  ]
}