{
    "SYSTEM_MSG_1": {
        "content": "You are an AI assistant that helps people find information. You will receive a task and think step by step. Then provide your final outcome following the regular expression 'Answer: there are [0-9]+ clusters'"
    },
    "SYSTEM_MSG_2": {
        "content": "You are an AI assistant that helps people find information. You will receive a task and think step by step. Then provide your final outcome following the regular expression 'Answer: ([0-9]+,\\s*)*[0-9]+'"
    },
    "nClusters": {
        "content": "Imagine a castle with 15 rooms. Room 1, room 7, room 10, room 13, and room 11 are all connected to each other. Room 2, room 5, room 8, room 11, and room 14 are connected to each other. Room 3, room 6, room 9, room 12, and room 8 are all connected to each other. Room 4, room 7, room 10, room 13, and room 15 are connected to each other. Room 5, room 8, room 11, and room 14 are connected to each other. Room 6, room 9, room 12, and room 15 are connected to each other. Room 7, room 10, and room 13 are connected to each other. Room 8 is connected to room 14. Room 9, room 12 and room 15 are connected to each other. Room 10 is connected to room 13. Room 11 is connected to room 14. Room 12 is connected to room 15. How many densely-connected room clusters do we have in this castle? A densely-connected cluster is a group of rooms that are connected to themselves with a max of 2 rooms.",
        "response_pattern": "Answer: [Tt]here are [0-9]+ clusters"
    },
    "nClustersFloors": {
        "content": "Imagine a castle with 15 rooms. On the first floor, room 1, room 7, room 10, and room 13 are all connected to each other. Room 4, room 7, room 10, and room 13 are connected to each other. Room 7, room 10, and room 13 are connected to each other. Room 10 is connected to room 13.  On the second floor, room 2, room 5, room 8, room 11, and room 14 are connected to each other. Room 5, room 8, room 11, and room 14 are connected to each other. Room 8 is connected to room 14. Room 11 is connected to room 14.  On the third floor, room 3, room 6, room 9, and room 12 are all connected to each other. Room 6, room 9, room 12, and room 15 are connected to each other. Room 9, room 12 and room 15 are connected to each other. Room 12 is connected to room 15.  There is a staircase that connects room 1 on the first floor to room 11 on the second floor. There is another staircase that connects room 8 on the second floor to room 3 on the third floor. There is also a staircase that connects room 15 on the third floor to room 4 on the first floor.  How many densely-connected room clusters do we have in this castle? A densely-connected cluster is a group of rooms that are connected to themselves with a max of 2 rooms. ",
        "response_pattern": "Answer: [Tt]here are [0-9]+ clusters"
    },
    "1stepPath": {
        "content": "Imagine a castle with 15 rooms. Room 1, room 7, room 10, room 13, and room 11 are all connected to each other. Room 2, room 5, room 8, room 11, and room 14 are connected to each other. Room 3, room 6, room 9, room 12, and room 8 are all connected to each other. Room 4, room 7, room 10, room 13, and room 15 are connected to each other. Room 5, room 8, room 11, and room 14 are connected to each other. Room 6, room 9, room 12, and room 15 are connected to each other. Room 7, room 10, and room 13 are connected to each other. Room 8 is connected to room 14. Room 9, room 12 and room 15 are connected to each other. Room 10 is connected to room 13. Room 11 is connected to room 14. Room 12 is connected to room 15. What is the shortest path from room 1 to room 7? Please list the room numbers in order, separated by commas.",
        "response_pattern": "Answer: ([0-9]+,\\s*)*[0-9]+"
    },
    "2stepPath": {
        "content": "Imagine a castle with 15 rooms. Room 1, room 7, room 10, room 13, and room 11 are all connected to each other. Room 2, room 5, room 8, room 11, and room 14 are connected to each other. Room 3, room 6, room 9, room 12, and room 8 are all connected to each other. Room 4, room 7, room 10, room 13, and room 15 are connected to each other. Room 5, room 8, room 11, and room 14 are connected to each other. Room 6, room 9, room 12, and room 15 are connected to each other. Room 7, room 10, and room 13 are connected to each other. Room 8 is connected to room 14. Room 9, room 12 and room 15 are connected to each other. Room 10 is connected to room 13. Room 11 is connected to room 14. Room 12 is connected to room 15. What is the shortest path from room 1 to room 2? Please list the room numbers in order, separated by commas.",
        "response_pattern": "Answer: ([0-9]+,\\s*)*[0-9]+"
    },
    "3stepPath": {
        "content": "Imagine a castle with 15 rooms. Room 1, room 7, room 10, room 13, and room 11 are all connected to each other. Room 2, room 5, room 8, room 11, and room 14 are connected to each other. Room 3, room 6, room 9, room 12, and room 8 are all connected to each other. Room 4, room 7, room 10, room 13, and room 15 are connected to each other. Room 5, room 8, room 11, and room 14 are connected to each other. Room 6, room 9, room 12, and room 15 are connected to each other. Room 7, room 10, and room 13 are connected to each other. Room 8 is connected to room 14. Room 9, room 12 and room 15 are connected to each other. Room 10 is connected to room 13. Room 11 is connected to room 14. Room 12 is connected to room 15. What is the shortest path from room 1 to room 15? Please list the room numbers in order, separated by commas.",
        "response_pattern": "Answer: ([0-9]+,\\s*)*[0-9]+"
    },
    "nstepPath": {
        "content": "Imagine a castle with 15 rooms. Room 1, room 7, room 10, room 13, and room 11 are all connected to each other. Room 2, room 5, room 8, room 11, and room 14 are connected to each other. Room 3, room 6, room 9, room 12, and room 8 are all connected to each other. Room 4, room 7, room 10, room 13, and room 15 are connected to each other. Room 5, room 8, room 11, and room 14 are connected to each other. Room 6, room 9, room 12, and room 15 are connected to each other. Room 7, room 10, and room 13 are connected to each other. Room 8 is connected to room 14. Room 9, room 12 and room 15 are connected to each other. Room 10 is connected to room 13. Room 11 is connected to room 14. Room 12 is connected to room 15. What is the shortest path from room 1 to room 12? Please list the room numbers in order, separated by commas.",
        "response_pattern": "Answer: ([0-9]+,\\s*)*[0-9]+"
    },
    "valuePath": {
        "content": "Imagine a castle with 15 rooms. Room 1, room 7, room 10, room 13, and room 11 are all connected to each other. Room 2, room 5, room 8, room 11, and room 14 are connected to each other. Room 3, room 6, room 9, room 12, and room 8 are all connected to each other. Room 4, room 7, room 10, room 13, and room 15 are connected to each other. Room 5, room 8, room 11, and room 14 are connected to each other. Room 6, room 9, room 12, and room 15 are connected to each other. Room 7, room 10, and room 13 are connected to each other. Room 8 is connected to room 14. Room 9, room 12 and room 15 are connected to each other. Room 10 is connected to room 13. Room 11 is connected to room 14. Room 12 is connected to room 15. Now you have been told that there is a reward of 10 for visiting room 8. From room 1 what is the path that yields the most reward? Please list the room numbers in order, separated by commas.",
        "response_pattern": "Answer: ([0-9]+,\\s*)*[0-9]+"
    },
    "transReval": {
        "content": "Imagine a castle with 15 rooms. Room 1, room 7, room 10, room 13, and room 11 are all connected to each other. Room 2, room 5, room 8, room 11, and room 14 are connected to each other. Room 3, room 6, room 9, room 12, and room 8 are all connected to each other. Room 4, room 7, room 10, room 13, and room 15 are connected to each other. Room 5, room 8, room 11, and room 14 are connected to each other. Room 6, room 9, room 12, and room 15 are connected to each other. Room 7, room 10, and room 13 are connected to each other. Room 8 is connected to room 14. Room 9, room 12 and room 15 are connected to each other. Room 10 is connected to room 13. Room 11 is connected to room 14. Room 12 is connected to room 15. Assume now that rooms 1 and 3 are connected. From room 1 what is the path that yields the most reward? Please list the room numbers in order, separated by commas.",
        "response_pattern": "Answer: ([0-9]+,\\s*)*[0-9]+"
    },
    "rewardReval": {
        "content": "Imagine a castle with 15 rooms. Room 1, room 7, room 10, room 13, and room 11 are all connected to each other. Room 2, room 5, room 8, room 11, and room 14 are connected to each other. Room 3, room 6, room 9, room 12, and room 8 are all connected to each other. Room 4, room 7, room 10, room 13, and room 15 are connected to each other. Room 5, room 8, room 11, and room 14 are connected to each other. Room 6, room 9, room 12, and room 15 are connected to each other. Room 7, room 10, and room 13 are connected to each other. Room 8 is connected to room 14. Room 9, room 12 and room 15 are connected to each other. Room 10 is connected to room 13. Room 11 is connected to room 14. Room 12 is connected to room 15. Now you have been told that there is a reward of 5 for visiting room 14. From room 1 what is the path that yields the most reward? Please list the room numbers in order, separated by commas.",
        "response_pattern": "Answer: ([0-9]+,\\s*)*[0-9]+"
    },
    "policyReval": {
        "content": "Imagine a castle with 15 rooms. Room 1, room 7, room 10, room 13, and room 11 are all connected to each other. Room 2, room 5, room 8, room 11, and room 14 are connected to each other. Room 3, room 6, room 9, room 12, and room 8 are all connected to each other. Room 4, room 7, room 10, room 13, and room 15 are connected to each other. Room 5, room 8, room 11, and room 14 are connected to each other. Room 6, room 9, room 12, and room 15 are connected to each other. Room 7, room 10, and room 13 are connected to each other. Room 8 is connected to room 14. Room 9, room 12 and room 15 are connected to each other. Room 10 is connected to room 13. Room 11 is connected to room 14. Room 12 is connected to room 15. Now you have been told that there is a reward of 5 for visiting room 14. From room 1 what is the path that yields the most reward? Please list the room numbers in order, separated by commas.",
        "response_pattern": "Answer: ([0-9]+,\\s*)*[0-9]+"
    },
    "teleShortcut": {
        "content": "Imagine a castle with 15 rooms. Room 1, room 7, room 10, room 13, and room 11 are all connected to each other. Room 2, room 5, room 8, room 11, and room 14 are connected to each other. Room 3, room 6, room 9, room 12, and room 8 are all connected to each other. Room 4, room 7, room 10, room 13, and room 15 are connected to each other. Room 5, room 8, room 11, and room 14 are connected to each other. Room 6, room 9, room 12, and room 15 are connected to each other. Room 7, room 10, and room 13 are connected to each other. Room 8 is connected to room 14. Room 9, room 12 and room 15 are connected to each other. Room 10 is connected to room 13. Room 11 is connected to room 14. Room 12 is connected to room 15. You are in room 1 and a portal appears with which you can teleport to any room only once. From room 1, what is the path that yields the most reward? Please list the room numbers in order, separated by commas.",
        "response_pattern": "Answer: ([0-9]+,\\s*)*[0-9]+"
    },
    "nonteleShortcut": {
        "content": "Imagine a castle with 15 rooms. Room 1, room 7, room 10, room 13, and room 11 are all connected to each other. Room 2, room 5, room 8, room 11, and room 14 are connected to each other. Room 3, room 6, room 9, room 12, and room 8 are all connected to each other. Room 4, room 7, room 10, room 13, and room 15 are connected to each other. Room 5, room 8, room 11, and room 14 are connected to each other. Room 6, room 9, room 12, and room 15 are connected to each other. Room 7, room 10, and room 13 are connected to each other. Room 8 is connected to room 14. Room 9, room 12 and room 15 are connected to each other. Room 10 is connected to room 13. Room 11 is connected to room 14. Room 12 is connected to room 15. You have been told that room 11 is now connected to room 8. From room 1, what is the path that yields the most reward? Please list the room numbers in order, separated by commas.",
        "response_pattern": "Answer: ([0-9]+,\\s*)*[0-9]+"
    },
    "teleDetour": {
        "content": "Imagine a castle with 15 rooms. Room 1, room 7, room 10, room 13, and room 11 are all connected to each other. Room 2, room 5, room 8, room 11, and room 14 are connected to each other. Room 3, room 6, room 9, room 12, and room 8 are all connected to each other. Room 4, room 7, room 10, room 13, and room 15 are connected to each other. Room 5, room 8, room 11, and room 14 are connected to each other. Room 6, room 9, room 12, and room 15 are connected to each other. Room 7, room 10, and room 13 are connected to each other. Room 8 is connected to room 14. Room 9, room 12 and room 15 are connected to each other. Room 10 is connected to room 13. Room 11 is connected to room 14. Room 12 is connected to room 15. You are in room 1 and a portal appears with which you can teleport to any room only once. At the same time, you have been told that there is no connection between room 1 and 11. From room 1, what is the path that yields the most reward? Please list the room numbers in order, separated by commas.",
        "response_pattern": "Answer: ([0-9]+,\\s*)*[0-9]+"
    },
    "nonteleDetour": {
        "content": "Imagine a castle with 15 rooms. Room 1, room 7, room 10, room 13, and room 11 are all connected to each other. Room 2, room 5, room 8, room 11, and room 14 are connected to each other. Room 3, room 6, room 9, room 12, and room 8 are all connected to each other. Room 4, room 7, room 10, room 13, and room 15 are connected to each other. Room 5, room 8, room 11, and room 14 are connected to each other. Room 6, room 9, room 12, and room 15 are connected to each other. Room 7, room 10, and room 13 are connected to each other. Room 8 is connected to room 14. Room 9, room 12 and room 15 are connected to each other. Room 10 is connected to room 13. Room 11 is connected to room 14. Room 12 is connected to room 15. You are in room 1 and you have been told that there is no connection between room 1 and 11, but room 1 and 15 are now connected. From room 1, what is the path that yields the most reward? Please list the room numbers in order, separated by commas.",
        "response_pattern": "Answer: ([0-9]+,\\s*)*[0-9]+"
    },
    "CONVERSATIONS": [
        {
            "valuePath": [
                {"prompt_id": "SYSTEM_MSG_2"},
                {"prompt_id":"valuePath", "expected_answer": ["Answer: 1, 11, 2, 8", "Answer: 1, 11, 14, 8", "Answer: 1, 11, 5, 8", "Answer: 1,11,2,8", "Answer: 1,11,14,8", "Answer: 1,11,5,8"]}
            ]
        },
        {
            "transReval": [
                {"prompt_id": "SYSTEM_MSG_2"},
                {"prompt_id":"transReval", "expected_answer": ["Answer: 1, 3, 8", "Answer: 1,3,8"]}
            ]
        },
        {
            "rewardReval": [
                {"prompt_id": "SYSTEM_MSG_2"},
                {"prompt_id":"rewardReval", "expected_answer": ["Answer: 1, 11, 14, 8", "Answer: 1,11,14,8"]}
            ]
        },
        {
            "policyReval": [
                {"prompt_id": "SYSTEM_MSG_2"},
                {"prompt_id":"policyReval", "expected_answer": ["Answer: 1, 11, 14, 8", "Answer: 1,11,14,8"]}
            ]
        },
        {
            "teleShortcut": [
                {"prompt_id": "SYSTEM_MSG_2"},
                {"prompt_id":"teleShortcut", "expected_answer": ["Answer: 1, 8", "Answer: 1,8"]}
            ]
        },
        {
            "nonteleShortcut": [
                {"prompt_id": "SYSTEM_MSG_2"},
                {"prompt_id":"nonteleShortcut", "expected_answer": ["Answer: 1, 11, 8", "Answer: 1,11,8"]}
            ]
        },
        {
            "teleDetour": [
                {"prompt_id": "SYSTEM_MSG_2"},
                {"prompt_id":"teleDetour", "expected_answer": ["Answer: 1, 8", "Answer: 1,8"]}
            ]
        },
        {
            "nonteleDetour": [
                {"prompt_id": "SYSTEM_MSG_2"},
                {"prompt_id":"nonteleDetour", "expected_answer": ["Answer: 1, 15, 12, 3, 8", "Answer: 1, 15, 9, 3, 8", "Answer: 1, 15, 6, 3, 8", "Answer: 1,15,12,3,8", "Answer: 1,15,9,3,8", "Answer: 1,15,6,3,8"]}
            ]
        },
        {
            "nClusters": [
                {"prompt_id": "SYSTEM_MSG_1"},
                {"prompt_id":"nClusters", "expected_answer": ["Answer: there are 3 clusters"]}
            ]
        },
        {
            "1stepPath": [
                {"prompt_id": "SYSTEM_MSG_2"},
                {"prompt_id":"1stepPath", "expected_answer": ["Answer: 1, 7", "Answer: 1,7"]}
            ]
        },
        {
            "2stepPath": [
                {"prompt_id": "SYSTEM_MSG_2"},
                {"prompt_id":"2stepPath", "expected_answer": ["Answer: 1, 11, 2", "Answer: 1,11,2"]}
            ]
        },
        {
            "3stepPath": [
                {"prompt_id": "SYSTEM_MSG_2"},
                {"prompt_id":"3stepPath", "expected_answer": ["Answer: 1, 7, 4, 15", "Answer: 1, 10, 4, 15", "Answer: 1, 13, 4, 15", "Answer: 1,7,4,15", "Answer: 1,10,4,15", "Answer: 1,13,4,15"]}
            ]
        },
        {
            "nstepPath": [
                {"prompt_id": "SYSTEM_MSG_2"},
                {"prompt_id":"nstepPath", "expected_answer": ["Answer: 1, 7, 4, 15, 12", "Answer: 1, 10, 4, 15, 12", "Answer: 1, 13, 4, 15, 12", "Answer: 1,7,4,15,12", "Answer: 1,10,4,15,12", "Answer: 1,13,4,15,12"]}
            ]
        }
    ]
}
