{
  "SYSTEM_MSG_1": {
    "content": "You are an AI assistant that helps people find information. You will receive a task and think step by step. Then provide your final outcome following the regular expression 'Answer: there are [0-9]+ clusters'"
  },
  "SYSTEM_MSG_2": {
    "content": "You are an AI assistant that helps people find information. You will receive a task and think step by step. Then provide your final outcome following the regular expression 'Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+'"
  },
  "nClusters": {
    "content": "Imagine a class of 15 students. Vivian, Salma, Shanshan, Vadim, and Gongxue are all connected to each other. Paul, Solomon, Soheil, Gongxue, and Alice are connected to each other. Pierre, Abdul, Durga, Ajit, and Soheil are all connected to each other. Noah, Salma, Shanshan, Vadim, and Anisha are connected to each other. Solomon, Soheil, Gongxue, and Alice are connected to each other. Abdul, Durga, Ajit, and Anisha are connected to each other. Salma, Shanshan, and Vadim are connected to each other. Soheil is connected to Alice. Durga, Ajit and Anisha are connected to each other. Shanshan is connected to Vadim. Gongxue is connected to Alice. Ajit is connected to Anisha. How many densely-connected clusters do we have in this class? A densely-connected cluster is a group of students that are connected to themselves with a max of 2 students.",
    "response_pattern": "Answer: [Tt]here are [0-9]+ clusters"
  },
  "nClustersFloors": {
    "content": "Imagine a class of 15 students. The class is divided into several levels. On the first level, Vivian, Salma, Shanshan, and Vadim are all connected to each other. Noah, Salma, Shanshan, and Vadim are connected to each other. Salma, Shanshan, and Vadim are connected to each other. Shanshan is connected to Vadim.  On the second level, Paul, Solomon, Soheil, Gongxue, and Alice are connected to each other. Solomon, Soheil, Gongxue, and Alice are connected to each other. Soheil is connected to Alice. Gongxue is connected to Alice.  On the third level, Pierre, Abdul, Durga, and Ajit are all connected to each other. Abdul, Durga, Ajit, and Anisha are connected to each other. Durga, Ajit and Anisha are connected to each other. Ajit is connected to Anisha.  Vivian on the first level is connected to Gongxue on the second level on a social network app. Soheil on the second level is connected to Pierre on the third level on another app. Anisha on the third level is connected to Noah on the first level on a different app.  How many densely-connecte clusters do we have in this class? A densely-connected cluster is a group of students that are connected to themselves with a max of 2 students. ",
    "response_pattern": "Answer: [Tt]here are [0-9]+ clusters"
  },
  "1stepPath": {
    "content": "Imagine a class of 15 students. Vivian, Salma, Shanshan, Vadim, and Gongxue are all connected to each other. Paul, Solomon, Soheil, Gongxue, and Alice are connected to each other. Pierre, Abdul, Durga, Ajit, and Soheil are all connected to each other. Noah, Salma, Shanshan, Vadim, and Anisha are connected to each other. Solomon, Soheil, Gongxue, and Alice are connected to each other. Abdul, Durga, Ajit, and Anisha are connected to each other. Salma, Shanshan, and Vadim are connected to each other. Soheil is connected to Alice. Durga, Ajit and Anisha are connected to each other. Shanshan is connected to Vadim. Gongxue is connected to Alice. Ajit is connected to Anisha. What is the shortest connection path from Vivian to Salma? Please list the student names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "2stepPath": {
    "content": "Imagine a class of 15 students. Vivian, Salma, Shanshan, Vadim, and Gongxue are all connected to each other. Paul, Solomon, Soheil, Gongxue, and Alice are connected to each other. Pierre, Abdul, Durga, Ajit, and Soheil are all connected to each other. Noah, Salma, Shanshan, Vadim, and Anisha are connected to each other. Solomon, Soheil, Gongxue, and Alice are connected to each other. Abdul, Durga, Ajit, and Anisha are connected to each other. Salma, Shanshan, and Vadim are connected to each other. Soheil is connected to Alice. Durga, Ajit and Anisha are connected to each other. Shanshan is connected to Vadim. Gongxue is connected to Alice. Ajit is connected to Anisha. What is the shortest connection path from Vivian to Paul? Please list the student names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "3stepPath": {
    "content": "Imagine a class of 15 students. Vivian, Salma, Shanshan, Vadim, and Gongxue are all connected to each other. Paul, Solomon, Soheil, Gongxue, and Alice are connected to each other. Pierre, Abdul, Durga, Ajit, and Soheil are all connected to each other. Noah, Salma, Shanshan, Vadim, and Anisha are connected to each other. Solomon, Soheil, Gongxue, and Alice are connected to each other. Abdul, Durga, Ajit, and Anisha are connected to each other. Salma, Shanshan, and Vadim are connected to each other. Soheil is connected to Alice. Durga, Ajit and Anisha are connected to each other. Shanshan is connected to Vadim. Gongxue is connected to Alice. Ajit is connected to Anisha. What is the shortest path from Vivian to Anisha? Please list the student names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "nstepPath": {
    "content": "Imagine a class of 15 students. Vivian, Salma, Shanshan, Vadim, and Gongxue are all connected to each other. Paul, Solomon, Soheil, Gongxue, and Alice are connected to each other. Pierre, Abdul, Durga, Ajit, and Soheil are all connected to each other. Noah, Salma, Shanshan, Vadim, and Anisha are connected to each other. Solomon, Soheil, Gongxue, and Alice are connected to each other. Abdul, Durga, Ajit, and Anisha are connected to each other. Salma, Shanshan, and Vadim are connected to each other. Soheil is connected to Alice. Durga, Ajit and Anisha are connected to each other. Shanshan is connected to Vadim. Gongxue is connected to Alice. Ajit is connected to Anisha. What is the shortest connection path from Vivian to Ajit? Please list the student names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "valuePath": {
    "content": "Imagine a class of 15 students. Vivian, Salma, Shanshan, Vadim, and Gongxue are all connected to each other. Paul, Solomon, Soheil, Gongxue, and Alice are connected to each other. Pierre, Abdul, Durga, Ajit, and Soheil are all connected to each other. Noah, Salma, Shanshan, Vadim, and Anisha are connected to each other. Solomon, Soheil, Gongxue, and Alice are connected to each other. Abdul, Durga, Ajit, and Anisha are connected to each other. Salma, Shanshan, and Vadim are connected to each other. Soheil is connected to Alice. Durga, Ajit and Anisha are connected to each other. Shanshan is connected to Vadim. Gongxue is connected to Alice. Ajit is connected to Anisha. Now you have been told that there is a reward of 10 for connecting with Soheil. From Vivian what is the connection path that yields the most reward? Please list the student names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "transReval": {
    "content": "Imagine a class of 15 students. Vivian, Salma, Shanshan, Vadim, and Gongxue are all connected to each other. Paul, Solomon, Soheil, Gongxue, and Alice are connected to each other. Pierre, Abdul, Durga, Ajit, and Soheil are all connected to each other. Noah, Salma, Shanshan, Vadim, and Anisha are connected to each other. Solomon, Soheil, Gongxue, and Alice are connected to each other. Abdul, Durga, Ajit, and Anisha are connected to each other. Salma, Shanshan, and Vadim are connected to each other. Soheil is connected to Alice. Durga, Ajit and Anisha are connected to each other. Shanshan is connected to Vadim. Gongxue is connected to Alice. Ajit is connected to Anisha. Assume now that Vivian and Pierre are connected. From Vivian what is the connection path that yields the most reward? Please list the student names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "rewardReval": {
    "content": "Imagine a class of 15 students. Vivian, Salma, Shanshan, Vadim, and Gongxue are all connected to each other. Paul, Solomon, Soheil, Gongxue, and Alice are connected to each other. Pierre, Abdul, Durga, Ajit, and Soheil are all connected to each other. Noah, Salma, Shanshan, Vadim, and Anisha are connected to each other. Solomon, Soheil, Gongxue, and Alice are connected to each other. Abdul, Durga, Ajit, and Anisha are connected to each other. Salma, Shanshan, and Vadim are connected to each other. Soheil is connected to Alice. Durga, Ajit and Anisha are connected to each other. Shanshan is connected to Vadim. Gongxue is connected to Alice. Ajit is connected to Anisha. Now you have been told that there is a reward of 5 for connecting with Alice. From Vivian what is the connection path that yields the most reward? Please list the student names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "policyReval": {
    "content": "Imagine a class of 15 students. Vivian, Salma, Shanshan, Vadim, and Gongxue are all connected to each other. Paul, Solomon, Soheil, Gongxue, and Alice are connected to each other. Pierre, Abdul, Durga, Ajit, and Soheil are all connected to each other. Noah, Salma, Shanshan, Vadim, and Anisha are connected to each other. Solomon, Soheil, Gongxue, and Alice are connected to each other. Abdul, Durga, Ajit, and Anisha are connected to each other. Salma, Shanshan, and Vadim are connected to each other. Soheil is connected to Alice. Durga, Ajit and Anisha are connected to each other. Shanshan is connected to Vadim. Gongxue is connected to Alice. Ajit is connected to Anisha. Now you have been told that there is a reward of 5 for connecting with Alice. From Vivian what is the connection path that yields the most reward? Please list the student names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "teleShortcut": {
    "content": "Imagine a class of 15 students. Vivian, Salma, Shanshan, Vadim, and Gongxue are all connected to each other. Paul, Solomon, Soheil, Gongxue, and Alice are connected to each other. Pierre, Abdul, Durga, Ajit, and Soheil are all connected to each other. Noah, Salma, Shanshan, Vadim, and Anisha are connected to each other. Solomon, Soheil, Gongxue, and Alice are connected to each other. Abdul, Durga, Ajit, and Anisha are connected to each other. Salma, Shanshan, and Vadim are connected to each other. Soheil is connected to Alice. Durga, Ajit and Anisha are connected to each other. Shanshan is connected to Vadim. Gongxue is connected to Alice. Ajit is connected to Anisha. You are connected with Vivian and a new app appears in which you can connect to anyone only once. From Vivian, what is the connection path that yields the most reward? Please list the student names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "nonteleShortcut": {
    "content": "Imagine a class of 15 students. Vivian, Salma, Shanshan, Vadim, and Gongxue are all connected to each other. Paul, Solomon, Soheil, Gongxue, and Alice are connected to each other. Pierre, Abdul, Durga, Ajit, and Soheil are all connected to each other. Noah, Salma, Shanshan, Vadim, and Anisha are connected to each other. Solomon, Soheil, Gongxue, and Alice are connected to each other. Abdul, Durga, Ajit, and Anisha are connected to each other. Salma, Shanshan, and Vadim are connected to each other. Soheil is connected to Alice. Durga, Ajit and Anisha are connected to each other. Shanshan is connected to Vadim. Gongxue is connected to Alice. Ajit is connected to Anisha. You have been told that Gongxue is now connected to Soheil. From Vivian, what is the connection path that yields the most reward? Please list the student names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "teleDetour": {
    "content": "Imagine a class of 15 students. Vivian, Salma, Shanshan, Vadim, and Gongxue are all connected to each other. Paul, Solomon, Soheil, Gongxue, and Alice are connected to each other. Pierre, Abdul, Durga, Ajit, and Soheil are all connected to each other. Noah, Salma, Shanshan, Vadim, and Anisha are connected to each other. Solomon, Soheil, Gongxue, and Alice are connected to each other. Abdul, Durga, Ajit, and Anisha are connected to each other. Salma, Shanshan, and Vadim are connected to each other. Soheil is connected to Alice. Durga, Ajit and Anisha are connected to each other. Shanshan is connected to Vadim. Gongxue is connected to Alice. Ajit is connected to Anisha. You are connected with Vivian and a new app appears in which you can connect to anyone only once. At the same time, you have been told that there is no connection between Vivian and Gongxue. From Vivian, what is the connection path that yields the most reward? Please list the student names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "nonteleDetour": {
    "content": "Imagine a class of 15 students. Vivian, Salma, Shanshan, Vadim, and Gongxue are all connected to each other. Paul, Solomon, Soheil, Gongxue, and Alice are connected to each other. Pierre, Abdul, Durga, Ajit, and Soheil are all connected to each other. Noah, Salma, Shanshan, Vadim, and Anisha are connected to each other. Solomon, Soheil, Gongxue, and Alice are connected to each other. Abdul, Durga, Ajit, and Anisha are connected to each other. Salma, Shanshan, and Vadim are connected to each other. Soheil is connected to Alice. Durga, Ajit and Anisha are connected to each other. Shanshan is connected to Vadim. Gongxue is connected to Alice. Ajit is connected to Anisha. You are connected with Vivian and you have been told that there is no connection between Vivian and Gongxue, but Vivian and Anisha are now connected. From Vivian, what is the connection path that yields the most reward? Please list the student names in order, separated by commas.",
    "response_pattern": "Answer: ([A-Za-z ]+,\\s*)*[A-Za-z ]+"
  },
  "CONVERSATIONS": [
    {
      "valuePath": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "valuePath",
          "expected_answer": [
            "Answer: Vivian, Gongxue, Paul, Soheil",
            "Answer: Vivian, Gongxue, Alice, Soheil ",
            "Answer: Vivian, Gongxue, Solomon, Soheil "
          ]
        }
      ]
    },
    {
      "transReval": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "transReval",
          "expected_answer": [
            "Answer: Vivian, Pierre, Soheil"
          ]
        }
      ]
    },
    {
      "rewardReval": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "rewardReval",
          "expected_answer": [
            "Answer: Vivian, Gongxue, Alice, Soheil"
          ]
        }
      ]
    },
    {
      "policyReval": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "policyReval",
          "expected_answer": [
            "Answer: Vivian, Gongxue, Alice, Soheil"
          ]
        }
      ]
    },
    {
      "teleShortcut": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "teleShortcut",
          "expected_answer": [
            "Answer: Vivian, Soheil"
          ]
        }
      ]
    },
    {
      "nonteleShortcut": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "nonteleShortcut",
          "expected_answer": [
            "Answer: Vivian, Gongxue, Soheil"
          ]
        }
      ]
    },
    {
      "teleDetour": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "teleDetour",
          "expected_answer": [
            "Answer: Vivian, Soheil"
          ]
        }
      ]
    },
    {
      "nonteleDetour": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "nonteleDetour",
          "expected_answer": [
            "Answer: Vivian, Anisha, Ajit, Pierre, Soheil",
            "Answer: Vivian, Anisha, Durga, Pierre, Soheil ",
            "Answer: Vivian, Anisha, Abdul, Pierre, Soheil "
          ]
        }
      ]
    },
    {
      "nClusters": [
        {
          "prompt_id": "SYSTEM_MSG_1"
        },
        {
          "prompt_id": "nClusters",
          "expected_answer": [
            "Answer: there are 3 clusters"
          ]
        }
      ]
    },
    {
      "1stepPath": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "1stepPath",
          "expected_answer": [
            "Answer: Vivian, Salma"
          ]
        }
      ]
    },
    {
      "2stepPath": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "2stepPath",
          "expected_answer": [
            "Answer: Vivian, Gongxue, Paul"
          ]
        }
      ]
    },
    {
      "3stepPath": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "3stepPath",
          "expected_answer": [
            "Answer: Vivian, Salma, Noah, Anisha",
            "Answer: Vivian, Shanshan, Noah, Anisha ",
            "Answer: Vivian, Vadim, Noah, Anisha"
          ]
        }
      ]
    },
    {
      "nstepPath": [
        {
          "prompt_id": "SYSTEM_MSG_2"
        },
        {
          "prompt_id": "nstepPath",
          "expected_answer": [
            "Answer: Vivian, Salma, Noah, Anisha, Ajit ",
            "Answer Vivian, Shanshan, Noah, Anisha, Ajit",
            "Answer: Vivian, Vadim, Noah, Anisha, Ajit"
          ]
        }
      ]
    }
  ]
}